//ÐëÞèïò ìåôáâëçôþí
#define var 10

//ÐëÞèïò Literals
#define num (var*2)

//ÐëÞèïò üñùí ôïõ êÜèå ðñïâëÞìáôïò
#define cl 50

//ÐëÞèïò ðñïâëçìÜôùí ðñïò åðßëõóç
#define provlimata 3

//¼ñéï ìÝãéóôùí åðáíåêêéíÞóåùí ôõ÷áßáò áñ÷éêÞò êáôÜóôáóçò
#define maxTries 10

//¼ñéï áëëáãþí áíá ðñïóðÜèåéá 
#define maxFlips 40

//Ðéèáíüôçôá åðéëïãÞò ôïõ êáëýôåñïõ ìç âåëôéùôéêïý flip , óôïí áëãüñéèìï WalkSat
#define probability 0.4





//ÓõíÜñôçóç Äçìéïõñãßáò Ôõ÷áßïõ ðñïâëÞìáôïò
void rand_prob();

//ÓõíÜñôçóç ôõ÷áßáò áíÜèåóçò ôéìþí áëÞèåéáò óôéò ìåôáâëçôÝò 
void rand_value();

//ÓõíÜñôçóç áðïôßìçóçò ôùí false üñùí ôçò êáôÜóôáóçò 
int evaluation (char hold_f);

//ÓõíÜñôçóç áëëáãÞò ôéìÞò ìéáò ìåôáâëçôÞò êáé ôçò áñíçôéêÞò ôçò
void flip (int q);

//ÓõíÜñôçóç ôý÷áéáò åðéëïãçò false Clause
void select_f_cl(int cost);


//ÓõíáñôÞóåéò åýñåóçò ìïíôÝëïõ ïðïõ éêáíïðïéïýíôáé ïëïé ïé üñïé

//Õëïðïßçóç Gsat
void Gsat();
//Õëïðïßçóç WalkSat
void WalkSat();
